#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/public-ips-test/runs/run-wRPz4WgmUyZvrkyX

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_eip.fnx_peplink_ip["13.213.210.190"]: Refreshing state... [id=eipalloc-0e6f766e94e473cd4]
aws_eip.fnx_peplink_ip["18.142.89.92"]: Refreshing state... [id=eipalloc-0ae5e7ea771dbac09]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.fnx_peplink_ip["18.142.89.92"] must be replaced
-/+ resource "aws_eip" "fnx_peplink_ip" {
      + address              = "18.142.89.92" # forces replacement
      ~ allocation_id        = "eipalloc-0ae5e7ea771dbac09" -> (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      ~ domain               = "vpc" -> (known after apply)
      ~ id                   = "eipalloc-0ae5e7ea771dbac09" -> (known after apply)
      + instance             = (known after apply)
      ~ network_border_group = "ap-southeast-1" -> (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      ~ public_dns           = "ec2-18-142-89-92.ap-southeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip            = "18.142.89.92" -> (known after apply)
      ~ public_ipv4_pool     = "amazon" -> (known after apply)
        tags                 = {
            "Name" = "peplink-public-ip-2"
        }
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ fnx_peplink_public_ips = [
        {
            eip_id     = "eipalloc-0e6f766e94e473cd4"
            ip_address = null
        },
      + {
          + eip_id     = (known after apply)
          + ip_address = "18.142.89.92"
        },
    ]

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 2 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @JoseFMP, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Action for Pull Requests`*